; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v7 - type_2 ?v4 - type_1)
 	      (pred_4 ?v5 - object ?v4 - type_1)
	      (pred_2 ?v7 - type_2 ?v3 - type_3)
	      (pred_3 ?v7 - type_2 ?v5 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v6 ?v1 - type_1)
       :precondition (and  (pred_1 ?v7 ?v6))
       :effect (and  (pred_1 ?v7 ?v1)
		     (not (pred_1 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_2 ?v2 - object ?v8 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v8) (pred_1 ?v7 ?v8) (pred_2 ?v7 ?v3))
       :effect (and (pred_3 ?v7 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v8)) 
		    (not (pred_2 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_2 ?v2 - object ?v8 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v2 ?v3) (pred_1 ?v7 ?v8))
       :effect (and (pred_4 ?v2 ?v8)
		    (pred_2 ?v7 ?v3)
		    (not (pred_3 ?v7 ?v2 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_12 - type_2
obj_11 obj_09 obj_10 obj_08 - type_3
obj_01 obj_04 obj_03 - type_1
obj_07 obj_02 obj_06 - object)
(:init
(pred_1 obj_05 obj_03)
(pred_2 obj_05 obj_11)
(pred_2 obj_05 obj_09)
(pred_1 obj_12 obj_04)
(pred_2 obj_12 obj_10)
(pred_2 obj_12 obj_08)
(pred_4 obj_07 obj_01)
(pred_4 obj_02 obj_01)
(pred_4 obj_06 obj_04)
)
(:goal
(and
(pred_4 obj_07 obj_03)
(pred_4 obj_02 obj_04)
(pred_4 obj_06 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_05 obj_03) (pred_1 obj_12 obj_03))))
  )
)
)

; plan
1. (op_2 obj_12 obj_06 obj_04 obj_08)
   deleted: (pred_4 obj_06 obj_04) (pred_2 obj_12 obj_08)
   added: (pred_3 obj_12 obj_06 obj_08)
   goals met: 0 of 3
2. (op_1 obj_05 obj_03 obj_04)
   deleted: (pred_1 obj_05 obj_03)
   added: (pred_1 obj_05 obj_04)
   goals met: 0 of 3
3. (op_1 obj_12 obj_04 obj_01)
   deleted: (pred_1 obj_12 obj_04)
   added: (pred_1 obj_12 obj_01)
   goals met: 0 of 3
4. (op_1 obj_05 obj_04 obj_01)
   deleted: (pred_1 obj_05 obj_04)
   added: (pred_1 obj_05 obj_01)
   goals met: 0 of 3
5. (op_2 obj_12 obj_07 obj_01 obj_10)
   deleted: (pred_4 obj_07 obj_01) (pred_2 obj_12 obj_10)
   added: (pred_3 obj_12 obj_07 obj_10)
   goals met: 0 of 3
6. (op_2 obj_05 obj_02 obj_01 obj_09)
   deleted: (pred_4 obj_02 obj_01) (pred_2 obj_05 obj_09)
   added: (pred_3 obj_05 obj_02 obj_09)
   goals met: 0 of 3
7. (op_1 obj_12 obj_01 obj_03)
   deleted: (pred_1 obj_12 obj_01)
   added: (pred_1 obj_12 obj_03)
   goals met: 0 of 3
8. (op_1 obj_05 obj_01 obj_04)
   deleted: (pred_1 obj_05 obj_01)
   added: (pred_1 obj_05 obj_04)
   goals met: 0 of 3
9. (op_3 obj_12 obj_06 obj_03 obj_08)
   deleted: (pred_3 obj_12 obj_06 obj_08)
   added: (pred_4 obj_06 obj_03) (pred_2 obj_12 obj_08)
   goals met: 1 of 3
10. (op_3 obj_12 obj_07 obj_03 obj_10)
   deleted: (pred_3 obj_12 obj_07 obj_10)
   added: (pred_4 obj_07 obj_03) (pred_2 obj_12 obj_10)
   goals met: 2 of 3
11. (op_3 obj_05 obj_02 obj_04 obj_09)
   deleted: (pred_3 obj_05 obj_02 obj_09)
   added: (pred_4 obj_02 obj_04) (pred_2 obj_05 obj_09)
   goals met: 3 of 3
